
## Plan Result (repos-context)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/23698558440)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.github_actions_repository_permissions.this[0]
  * module.this.github_branch_default.this
  * module.this.github_repository.this[0]
  * module.this.github_repository_ruleset.this[&#34;main&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.github_actions_repository_permissions.this[0] will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions      = "all"
      + enabled              = true
      + id                   = (known after apply)
      + repository           = "repos-context"
      + sha_pinning_required = (known after apply)
    }

  # module.this.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "repos-context"
    }

  # module.this.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = true
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + allow_update_branch                     = true
      + archived                                = false
      + auto_init                               = true
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = true
      + description                             = "Provides contextual information for AI assistants working with repositories."
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_issues                              = true
      + has_projects                            = false
      + has_wiki                                = false
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "repos-context"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "repos-context",
        ]
      + visibility                              = "public"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis (known after apply)
    }

  # module.this.github_repository_ruleset.this["main"] will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "main"
      + node_id     = (known after apply)
      + repository  = "repos-context"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + deletion                      = false
          + non_fast_forward              = false
          + required_linear_history       = true
          + required_signatures           = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = true
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":1526,"Program":"tfcmt","SHA1":"88f54f4b0501b5c4ccf30bf2dd4c1a7ca2a48cca","Target":"repos-context","Vars":{},"WorkflowName":"Terraform - GitHub"} -->